In [3]:
import numpy as np
import pandas as pd

SERIES

In [4]:
s = pd.Series([20, 40, 80, 50, 50, 80, 50])

In [5]:
s.sum()

np.int64(370)

In [6]:
s.max()

np.int64(80)

MEASURE OF CENTER TENDENCY

In [7]:
s.min()

np.int64(20)

In [8]:
s.mean()

np.float64(52.857142857142854)

In [9]:
s.median()

np.float64(50.0)

MEASURE OF SPREAD

In [10]:
s.std()

np.float64(21.38089935299395)

In [11]:
s.var()

np.float64(457.14285714285717)

In [12]:
s.value_counts()

50    3
80    2
40    1
20    1
Name: count, dtype: int64

In [13]:
s.index

RangeIndex(start=0, stop=7, step=1)

In [14]:
s.values

array([20, 40, 80, 50, 50, 80, 50])

DATAFRAME

In [15]:
student_data = pd.DataFrame({
    "name"      : ['AMAN', 'ANIL', 'AMAN', 'VINIT', 'MAHESH'],
    "age"       : [20, 21, 20, 22, 21],
    "physics"   : [10, 91, 60, 70, 80],
    "chimistry" : [20, 30, 50, 45, 35],
    "maths"     : [40, 52, 56, 60, 50]
})

In [16]:
student_data

     name  age  physics  chimistry  maths
0    AMAN   20       10         20     40
1    ANIL   21       91         30     52
2    AMAN   20       60         50     56
3   VINIT   22       70         45     60
4  MAHESH   21       80         35     50

In [17]:
student_data['total'] = student_data['physics'] + student_data['chimistry'] + student_data['maths']

In [18]:
student_data['percentage'] = round(student_data.total / 3, ndigits=2)

In [19]:
student_data.sort_values(by = 'percentage', ascending= False, inplace= True, ignore_index= True )

In [20]:
student_data

     name  age  physics  chimistry  maths  total  percentage
0   VINIT   22       70         45     60    175       58.33
1    ANIL   21       91         30     52    173       57.67
2    AMAN   20       60         50     56    166       55.33
3  MAHESH   21       80         35     50    165       55.00
4    AMAN   20       10         20     40     70       23.33

In [21]:
def give_grades(percent):
    if percent < 33:
        return "F"
    
    elif percent < 50:
        return "C"
    
    elif percent < 60:
        return "B"
    
    elif percent < 90:
        return "A"
    
    else:
        return "A+"

In [22]:
student_data['grades'] = student_data['percentage'].apply(func= give_grades)

In [23]:
# BOOLEAN INDEXING

In [24]:
# find out names of those whose age is more than 21
# find out data of those who got failed
# find out those who got grade a or a+

In [25]:
student_data[student_data['maths'] > 55]

    name  age  physics  chimistry  maths  total  percentage grades
0  VINIT   22       70         45     60    175       58.33      B
2   AMAN   20       60         50     56    166       55.33      B

In [26]:
student_data[(student_data['physics'] > 55) & (student_data['physics'] < 75)]

    name  age  physics  chimistry  maths  total  percentage grades
0  VINIT   22       70         45     60    175       58.33      B
2   AMAN   20       60         50     56    166       55.33      B

In [27]:
#identify people who scored well in maths but not so good in physics
# maths > 50  , physics < 60   
# student_data['maths']  > 50
# student_data['physics'] < 60

#bitwise and - > &  (ampersand)
#bitwise or ->  | 
#bitwise not ->  ~ (tilde)


student_data[ (student_data['chimistry'] > 40)  & ( student_data[ 'maths' ] < 45) ]["name"]

Series([], Name: name, dtype: object)

In [28]:
# student_data

#what basic operation you can do on a table?

#DELETE COLUMN 
# del student_data['grades']
# student_data.drop(columns=['total', 'percentage'], inplace = True)

#RENAME COLUMN
# student_data.rename(columns={"physics": "bio", 'chimistry' : 'chemistry'}, inplace= True)
# student_data['bio'] = student_data['bio'].astype(dtype='float')


#CHNGE DATA TYPE
# student_data['bio'] = student_data['bio'].astype(dtype='float')

# DELTE ROWS VIA INDEXING
# student_data.drop(labels=[1,3])


#DELETE ROWS VIA CONDITION
# student_data.drop(student_data[student_data['maths']  > 55].index)

In [29]:
student_data.rename(columns={"physics": "bio", 'chimistry' : 'chemistry'}, inplace= True)

In [30]:
student_data['bio'] = student_data['bio'].astype(dtype='float')

In [31]:
student_data['name'] = student_data['name'].astype(dtype= 'str')

In [32]:
student_data.drop(labels=[1,3])

    name  age   bio  chemistry  maths  total  percentage grades
0  VINIT   22  70.0         45     60    175       58.33      B
2   AMAN   20  60.0         50     56    166       55.33      B
4   AMAN   20  10.0         20     40     70       23.33      F

In [33]:
student_data =student_data[~(student_data['grades'] == 'F')]

In [34]:
student_data

     name  age   bio  chemistry  maths  total  percentage grades
0   VINIT   22  70.0         45     60    175       58.33      B
1    ANIL   21  91.0         30     52    173       57.67      B
2    AMAN   20  60.0         50     56    166       55.33      B
3  MAHESH   21  80.0         35     50    165       55.00      B

In [35]:
student_data.drop(student_data[student_data['maths']  > 55].index)

     name  age   bio  chemistry  maths  total  percentage grades
1    ANIL   21  91.0         30     52    173       57.67      B
3  MAHESH   21  80.0         35     50    165       55.00      B

In [36]:
student_data[student_data['grades']  == 'F'].index

Index([], dtype='int64')

In [37]:
# dataframe.loc[row_slicing , columns names]

student_data.loc[1,  : : ]  = ['ANIL SHARMA', 22, 94, 40, 52, 175, 60, 'A' ]

In [38]:
student_data.loc[2:3, ['chemistry', 'maths', 'total']] = [[1,2, 3],[4, 5, 6]]

In [39]:
student_data.loc[student_data['total'] > 100, 'maths'] = [[50],[70]]

In [40]:
student_data

          name  age   bio  chemistry  maths  total  percentage grades
0        VINIT   22  70.0         45     50    175       58.33      B
1  ANIL SHARMA   22  94.0         40     70    175       60.00      A
2         AMAN   20  60.0          1      2      3       55.33      B
3       MAHESH   21  80.0          4      5      6       55.00      B

In [41]:
student_data.iloc[ 0:3, -2 : : ]

   percentage grades
0       58.33      B
1       60.00      A
2       55.33      B

In [42]:
df = pd.DataFrame({
    'OrderID': [101, 102],
    'Customer': ['Zomato', 'Swiggy'],
    'TotalBill': [250, 300]
})
df

   OrderID Customer  TotalBill
0      101   Zomato        250
1      102   Swiggy        300

In [43]:
df.loc[len(df)] = [103, 'Blinkit', 500]

In [44]:
df1 = pd.DataFrame({
    "name" : ["a", "b"], 
    "age"  : [20, 21]
}
)
df1

  name  age
0    a   20
1    b   21

In [45]:
df2 = pd.DataFrame({
    "name" : ["c", "d"], 
    "age"  : [22, 23]
}
)
df2

  name  age
0    c   22
1    d   23

In [46]:
pd.concat([df1, df2], ignore_index= True)

  name  age
0    a   20
1    b   21
2    c   22
3    d   23

In [ ]:
#how to do cleaning of dataset
# Data Format 
# DROP DUPLICATES
# HANLING MISSING VALUES (ROWS ONLY)  
    # -> Drop the data (not good in case of small data)
    # -> Fill the Data 
            #  categorical ->  mode , ffill , dfill
            #  numerical   ->  mean , median , mode , ffill , dfill 
            #  fill the data with joining (if data is availanble but 
            #  somewhere else?) # DATA ANALYSIS

In [48]:
df = pd.DataFrame({})

In [ ]:
#IDENTIFY MISSING DATA
# df.isna().sum()


# IDENTIFY DUPLICATEDS
# df.duplicated()

In [ ]:
df.dropna()
df.fillna()
df.drop()
df.drop_duplicates()

Empty DataFrame
Columns: []
Index: []

In [59]:
data = {
    'product_id': [101, 102, 103, 101, 104, 105, 102, 106, 107, 108],
    'product_name': [
        'LED TV', 'Laptop', 'Wireless Mouse', 'LED TV', 'Smartphone', 
        'Bluetooth Speaker', 'Laptop', 'Tablet', 'Smartwatch', 'Gaming Console'
    ],
    'price': [45000, 60000, 1200, 45000, np.nan, 2500, 61000, 15000, 9999, None],
    'category': [
        'Electronics', 'Electronics', 'Accessories', 'Electronics', 
        'Electronics', 'Audio', 'Electronics', 'Electronics', None, 'Gaming'
    ],
    'date_added': [
        '2024-01-15', '2024-01-20', '2024-02-10', '2024-01-15',
        '2024-03-01', '2024-03-10', '2024-01-20', '2024-04-05',
        None, '2024-05-12'
    ]
}

df = pd.DataFrame(data)

# Convert date_added to datetime format
df['date_added'] = pd.to_datetime(df['date_added'])

In [60]:
df

   product_id       product_name    price     category date_added
0         101             LED TV  45000.0  Electronics 2024-01-15
1         102             Laptop  60000.0  Electronics 2024-01-20
2         103     Wireless Mouse   1200.0  Accessories 2024-02-10
3         101             LED TV  45000.0  Electronics 2024-01-15
4         104         Smartphone      NaN  Electronics 2024-03-01
5         105  Bluetooth Speaker   2500.0        Audio 2024-03-10
6         102             Laptop  61000.0  Electronics 2024-01-20
7         106             Tablet  15000.0  Electronics 2024-04-05
8         107         Smartwatch   9999.0         None        NaT
9         108     Gaming Console      NaN       Gaming 2024-05-12

In [61]:
df['day']     = df['date_added'].dt.day
df['month']   = df['date_added'].dt.month
df['year']    = df['date_added'].dt.year
df['quarter'] = df['date_added'].dt.quarter
df['weekday'] = df['date_added'].dt.day_name()  # e.g., 'Monday'

In [63]:
df['date_verbose'] = df['date_added'].dt.strftime('%A, %d %B %Y')

In [66]:
df['product_name'] = df['product_name'].str.upper()

In [67]:
df

,product_id,product_name,price,category,date_added,day,month,year,quarter,weekday,date_verbose
0,101,LED TV,45000.0,Electronics,2024-01-15,15.0,1.0,2024.0,1.0,Monday,"Monday, 15 January 2024"
1,102,LAPTOP,60000.0,Electronics,2024-01-20,20.0,1.0,2024.0,1.0,Saturday,"Saturday, 20 January 2024"
2,103,WIRELESS MOUSE,1200.0,Accessories,2024-02-10,10.0,2.0,2024.0,1.0,Saturday,"Saturday, 10 February 2024"
3,101,LED TV,45000.0,Electronics,2024-01-15,15.0,1.0,2024.0,1.0,Monday,"Monday, 15 January 2024"
4,104,SMARTPHONE,NaN,Electronics,2024-03-01,1.0,3.0,2024.0,1.0,Friday,"Friday, 01 March 2024"
5,105,BLUETOOTH SPEAKER,2500.0,Audio,2024-03-10,10.0,3.0,2024.0,1.0,Sunday,"Sunday, 10 March 2024"
6,102,LAPTOP,61000.0,Electronics,2024-01-20,20.0,1.0,2024.0,1.0,Saturday,"Saturday, 20 January 2024"
7,106,TABLET,15000.0,Electronics,2024-04-05,5.0,4.0,2024.0,2.0,Friday,"Friday, 05 April 2024"
8,107,SMARTWATCH,9999.0,None,NaT,NaN,NaN,NaN,NaN,NaN,NaN
9,108,GAMING CONSOLE,NaN,Gaming,2024-05-12,12.0,5.0,2024.0,2.0,Sunday,"Sunday, 12 May 2024"

In [ ]:
df.isna().sum()  # idenfify missing data

product_id      0
product_name    0
price           2
category        1
date_added      1
day             1
month           1
year            1
quarter         1
weekday         1
date_verbose    1
dtype: int64

In [107]:
len(df[df.duplicated(subset=['product_id'])])

2

In [115]:
df.drop_duplicates(subset=['product_id'], ignore_index= True, inplace= True)

In [116]:
df

,product_id,product_name,price,category,date_added,day,month,year,quarter,weekday,date_verbose
0,101,LED TV,45000.0,Electronics,2024-01-15,15.0,1.0,2024.0,1.0,Monday,"Monday, 15 January 2024"
1,102,LAPTOP,60000.0,Electronics,2024-01-20,20.0,1.0,2024.0,1.0,Saturday,"Saturday, 20 January 2024"
2,103,WIRELESS MOUSE,1200.0,Accessories,2024-02-10,10.0,2.0,2024.0,1.0,Saturday,"Saturday, 10 February 2024"
3,104,SMARTPHONE,NaN,Electronics,2024-03-01,1.0,3.0,2024.0,1.0,Friday,"Friday, 01 March 2024"
4,105,BLUETOOTH SPEAKER,2500.0,Audio,2024-03-10,10.0,3.0,2024.0,1.0,Sunday,"Sunday, 10 March 2024"
5,106,TABLET,15000.0,Electronics,2024-04-05,5.0,4.0,2024.0,2.0,Friday,"Friday, 05 April 2024"
6,107,SMARTWATCH,9999.0,None,NaT,NaN,NaN,NaN,NaN,NaN,NaN
7,108,GAMING CONSOLE,NaN,Gaming,2024-05-12,12.0,5.0,2024.0,2.0,Sunday,"Sunday, 12 May 2024"

In [154]:
df

,product_id,product_name,price,category,date_added,day,month,year,quarter,weekday,date_verbose
0,101,LED TV,45000.000000,Electronics,2024-01-15,15.0,1.0,2024.0,1.0,Monday,"Monday, 15 January 2024"
1,102,LAPTOP,60000.000000,Electronics,2024-01-20,20.0,1.0,2024.0,1.0,Saturday,"Saturday, 20 January 2024"
2,103,WIRELESS MOUSE,1200.000000,Accessories,2024-02-10,10.0,2.0,2024.0,1.0,Saturday,"Saturday, 10 February 2024"
3,104,SMARTPHONE,22283.166667,Electronics,2024-03-01,1.0,3.0,2024.0,1.0,Friday,"Friday, 01 March 2024"
4,105,BLUETOOTH SPEAKER,2500.000000,Audio,2024-03-10,10.0,3.0,2024.0,1.0,Sunday,"Sunday, 10 March 2024"
5,106,TABLET,15000.000000,Electronics,2024-04-05,5.0,4.0,2024.0,2.0,Friday,"Friday, 05 April 2024"
6,107,SMARTWATCH,9999.000000,Electronics,2024-05-12,NaN,NaN,NaN,NaN,NaN,NaN
7,108,GAMING CONSOLE,22283.166667,Gaming,2024-05-12,12.0,5.0,2024.0,2.0,Sunday,"Sunday, 12 May 2024"

In [153]:
df['date_added'].fillna(method = 'bfill', inplace= True)

C:\Users\bhawa\AppData\Local\Temp\ipykernel_6372\1880955649.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['date_added'].fillna(method = 'bfill', inplace= True)

In [135]:
df['price'].mean()

np.float64(22283.166666666668)

In [147]:
df['category'].mode()[0]

'Electronics'

In [139]:
df['price'].fillna(df['price'].mean(), inplace= True)

C:\Users\bhawa\AppData\Local\Temp\ipykernel_6372\2825470260.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['price'].fillna(df['price'].mean(), inplace= True)

In [148]:
df['category'].fillna(df['category'].mode()[0], inplace= True)

In [ ]:
#how to do cleaning of dataset
# Data Format 
# DROP DUPLICATES
# HANLING MISSING VALUES (ROWS ONLY)  
    # -> Drop the data (not good in case of small data)
    # -> Fill the Data 
            #  categorical ->  mode , ffill , dfill
            #  numerical   ->  mean , median , mode , ffill , dfill 
            #  fill the data with joining (if data is availanble but 
            #  somewhere else?) # DATA ANALYSIS